<center>
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="300" alt="cognitiveclass.ai logo">
</center>

# Create and access SQLite database using Python

### Objectives
This lab covers the following:

*   Creating a database
*   Creating a table
*   Inserting data into the table
*   Querying data from the table
*   Reading a SQL query and loading the resulting data into a Pandas DataFrame
*   Closing the database connection

### Task 1: Creating a database

In [1]:
# Install & load sqlite3
# !pip install sqlite3  ##Uncomment the code to install sqlite3
import sqlite3

In [2]:
# Connect to sqlite3 database
conn = sqlite3.connect('INSTRUCTOR.db')

In [3]:
# Create cursor object to send SQL statements to the database
cursor_obj = conn.cursor()

### Task 2: Creating a table

In [4]:
# Drop the table if it already exists
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [5]:
# Create the table if it does not exist
table = """ create table IF NOT EXISTS INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""
cursor_obj.execute(table)

# Print confirmation that the table has been created
print("Table is Ready")

Table is Ready

### Task 3: Inserting data into the table

In [6]:
# Insert a first row of data
cursor_obj.execute('''insert into INSTRUCTOR values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

In [7]:
# Single query to insert the two rows of data
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

### Task 4: Querying data from the table

In [8]:
# Create statement to query all columns in the table
statement = '''SELECT * FROM INSTRUCTOR'''

# Execute statement
cursor_obj.execute(statement)

# Print header
print("All the data")

# Fetch all rows from the table
output_all = cursor_obj.fetchall()
for row_all in output_all:
  
# Print results
  print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [9]:
# Create statement to query all columns in the table
statement = '''SELECT * FROM INSTRUCTOR'''

# Execute statement
cursor_obj.execute(statement)

# Print header
print("All the data")

# Fetch multiple rows from the table using fetchmany(number of rows) from the table
output_many = cursor_obj.fetchmany(2) 
for row_many in output_many:

# Print results of query
  print(row_many)
output_all = cursor_obj.fetchall()

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [22]:
# Create statement to query the FNAME column in the table
statement = '''SELECT FNAME FROM INSTRUCTOR'''

# Execute statement
cursor_obj.execute(statement)

# Print header
print("All the data")

# Fetch and print all rows of the query from the table
output_all = cursor_obj.fetchall()
for row_all in output_all:

# Print results of query
  print(row_all)

All the data
('Rav',)
('Raul',)
('Hima',)

In [10]:
# Create statement to update a row of table
query_update='''update INSTRUCTOR set CITY='MOOSETOWN' where FNAME="Rav"'''

# Execute query update
cursor_obj.execute(query_update)

In [11]:
# Print table to see updated row
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
  print(row)

All the data
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

### Task 5: Reading a SQL query and loading the resulting data into a Pandas DataFrame

In [12]:
# Import Pandas
import pandas as pd

# Execute a SQL query directly and load the resulting data into a Pandas DataFrame
df = pd.read_sql_query("select * from instructor;", conn)

# Print the DataFrame
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [13]:
# Print the LNAME column for just the first row in the Pandas DataFrame
df.LNAME[0]

'Ahuja'

In [14]:
# Use the shape method to see how many rows and columns are in the Pandas DataFrame
df.shape

(3, 5)

### Task 6: Close the connection

In [15]:
# We free all resources by closing the connection. It is always important to close connections to avoid unused connections taking up resources
conn.close